#include "Player.h"
#include <cassert>

using namespace KamataEngine;

/*=================================================
                    コンストラクタ
=================================================*/
Player::Player() {}

/*=================================================
                    デストラクタ
=================================================*/
Player::~Player() {}

/*=================================================
                        初期化
=================================================*/
// 23ページめでもうバグってるよ
void Player::Initialize(Model* model, uint32_t textureHandle,Camera*camera) {
	// NULLポインタチェック
	assert(model);
	// モデルデータをメンバ変数に記録
	model_ = model;
	// テクスチャデータをメンバ変数に記録
	textureHandle_ = textureHandle;
	// カメラデータをメンバ変数に記録
	camera_ = camera;
}

/*=================================================
                        更新
=================================================*/
void Player::Update() {
	// 行列を定数バッファに転送
	worldTransform_.TransferMatrix();
}

/*=================================================
                        描画
=================================================*/
void Player::Draw() {
	// 3Dモデルを描画(34ページめバグってるよ)
	model_->Draw(&worldTransform_, &camera_, textureHandle_);
}